ermacv/open-esp-radio-rs/svd/esp32s31-platform-radio-deps.svd
      </registers>
    </peripheral>

    <peripheral>
      <name>I2C_ANA_MST</name>
      <description>SOURCE[ESP32S31_PAC_D0FB94E,ROM_REV0_PHY_I2C,BLOB_LIBPHY_PHY_I2C]. Platform-owned analog-register I2C master.</description>
      <baseAddress>0x2010f800</baseAddress>
      <registers>
        <register>
          <name>I2C0_CTRL</name>
          <description>Analog-register I2C host-0 command and completion word.</description>
          <addressOffset>0x00</addressOffset><size>32</size><access>read-write</access><resetValue>0x00000000</resetValue>
          <fields>
            <field><name>SLAVE_ADDR</name><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field>
            <field><name>SLAVE_REG_ADDR</name><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field>
            <field><name>DATA</name><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field>
            <field><name>READ_WRITE</name><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>BUSY</name><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>START_OR_RESET</name><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>I2C1_CTRL</name>
          <description>Analog-register I2C host-1 command and completion word.</description>
          <addressOffset>0x04</addressOffset><size>32</size><access>read-write</access><resetValue>0x00000000</resetValue>
          <fields>
            <field><name>SLAVE_ADDR</name><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field>
            <field><name>SLAVE_REG_ADDR</name><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field>
            <field><name>DATA</name><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field>
            <field><name>READ_WRITE</name><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>BUSY</name><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>START_OR_RESET</name><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>ANA_CONF0</name>
          <description>Shared analog-I2C master control used by PHY register mode and BBPLL calibration.</description>
          <addressOffset>0x18</addressOffset><size>32</size><access>read-write</access><resetValue>0x0000e408</resetValue>
          <fields>
            <field><name>BBPLL_CAL_MODE_UNKNOWN</name><bitOffset>2</bitOffset><bitWidth>2</bitWidth></field>
            <field><name>PHY_REGISTER_ENABLE</name><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>PHY_REGISTER_MODE</name><bitOffset>9</bitOffset><bitWidth>2</bitWidth></field>
            <field><name>ANA_STATUS0</name><bitOffset>24</bitOffset><bitWidth>8</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>ANA_CONF1</name>
          <description>Shared analog-I2C routing and read-mask word.</description>
          <addressOffset>0x1c</addressOffset><size>32</size><access>read-write</access><resetValue>0x0000002d</resetValue>
          <fields>
            <field><name>ANA_CONF1</name><bitOffset>0</bitOffset><bitWidth>24</bitWidth></field>
            <field><name>ANA_STATUS1</name><bitOffset>24</bitOffset><bitWidth>8</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>ANA_CONF2</name>
          <description>Shared analog-I2C host-selection word.</description>
          <addressOffset>0x20</addressOffset><size>32</size><access>read-write</access><resetValue>0x00000004</resetValue>
          <fields>
            <field><name>ANA_CONF2</name><bitOffset>0</bitOffset><bitWidth>24</bitWidth></field>
            <field><name>ANA_STATUS2</name><bitOffset>24</bitOffset><bitWidth>8</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>I2C0_CTRL1</name>
          <description>Host-0 timing and clock-selection control.</description>
          <addressOffset>0x24</addressOffset><size>32</size><access>read-write</access><resetValue>0x00000042</resetValue>
          <fields>
            <field><name>I2C0_SCL_PULSE_DUR</name><bitOffset>0</bitOffset><bitWidth>6</bitWidth></field>
            <field><name>I2C0_SDA_SIDE_GUARD</name><bitOffset>6</bitOffset><bitWidth>5</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>I2C1_CTRL1</name>
          <description>Host-1 timing and clock-selection control.</description>
          <addressOffset>0x28</addressOffset><size>32</size><access>read-write</access><resetValue>0x00000042</resetValue>
          <fields>
            <field><name>I2C1_SCL_PULSE_DUR</name><bitOffset>0</bitOffset><bitWidth>6</bitWidth></field>
            <field><name>I2C1_SDA_SIDE_GUARD</name><bitOffset>6</bitOffset><bitWidth>5</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>HW_I2C_CTRL</name>
          <description>Hardware-host timing and clock-selection control.</description>
          <addressOffset>0x2c</addressOffset><size>32</size><access>read-write</access><resetValue>0x00000042</resetValue>
          <fields>
            <field><name>HW_I2C_SCL_PULSE_DUR</name><bitOffset>0</bitOffset><bitWidth>6</bitWidth></field>
            <field><name>HW_I2C_SDA_SIDE_GUARD</name><bitOffset>6</bitOffset><bitWidth>5</bitWidth></field>
            <field><name>ARBITER_DIS</name><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
        </register>
      </registers>
    </peripheral>

    <peripheral>
      <name>PMU</name>
      <description>SOURCE[ESP32S31_PAC_D0FB94E,BLOB_LIBPHY_PHY_OPEN_I2C_XPD_NEW,ROM_REV0_PHY_OPEN_FE_BB_CLK]. Platform-owned power-management registers reached by radio initialization.</description>
      <baseAddress>0x20704000</baseAddress>
      <registers>
        <register>
          <name>HP_ACTIVE_HP_CK_POWER</name>
          <description>Active-state high-power clock and analog-I2C power control.</description>
          <addressOffset>0x1c</addressOffset><size>32</size><access>read-write</access><resetValue>0x00000000</resetValue>
          <fields>
            <field><name>ROM_OPEN_FE_BB_UNKNOWN_LOW</name><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field>
            <field><name>HP_ACTIVE_XPD_BB_I2C</name><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>IMM_HP_CK_POWER_0</name>
          <description>Immediate high-power clock tie controls used by analog-I2C power-up.</description>
          <addressOffset>0xf0</addressOffset><size>32</size><access>read-write</access><resetValue>0x00000000</resetValue>
          <fields>
            <field><name>TIE_HIGH_XPD_BB_I2C</name><bitOffset>28</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>RF_PWC</name>
          <description>RF circuit power control.</description>
          <addressOffset>0x184</addressOffset><size>32</size><access>read-write</access><resetValue>0x00000000</resetValue>
          <fields>
            <field><name>XPD_RF_CIRCUIT</name><bitOffset>16</bitOffset><bitWidth>16</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>ANA_PERI_PWR_CTRL</name>
          <description>Analog peripheral I2C power and reset control.</description>
          <addressOffset>0x208</addressOffset><size>32</size><access>read-write</access><resetValue>0x40000000</resetValue>
          <fields>
            <field><name>XPD_PERIF_I2C</name><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>RSTB_PERIF_I2C</name><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
        </register>
