ermacv/open-esp-radio-rs/svd/esp32s31-platform-radio-deps.svd
      </registers>
    </peripheral>

    <peripheral>
      <name>LP_AON_CLKRST</name>
      <description>SOURCE[ESP32S31_PAC_D0FB94E,ROM_REV0_PHY_POWER_DETECTOR]. Platform-owned low-power always-on clock/reset registers.</description>
      <baseAddress>0x20701000</baseAddress>
      <registers>
        <register>
          <name>RTC_SAR2_PWDET_CCT</name>
          <description>SAR2 power-detector circuit mode.</description>
          <addressOffset>0x68</addressOffset><size>32</size><access>read-write</access><resetValue>0x00000000</resetValue>
          <fields>
            <field><name>RTC_SAR2_PWDET_CCT</name><bitOffset>0</bitOffset><bitWidth>3</bitWidth></field>
          </fields>
        </register>
      </registers>
    </peripheral>

    <peripheral>
      <name>LP_PERICLKRST</name>
      <description>SOURCE[ESP32S31_PAC_D0FB94E,BLOB_LIBPHY_PHY_TSENS_READ_INIT]. Platform-owned low-power peripheral clock/reset registers.</description>
      <baseAddress>0x20710000</baseAddress>
      <registers>
        <register>
          <name>TSENS_CTRL</name>
          <description>Low-power temperature-sensor clock and reset control.</description>
          <addressOffset>0x30</addressOffset><size>32</size><access>read-write</access><resetValue>0x00000000</resetValue>
          <fields>
            <field><name>LP_TSENS_CLK_EN</name><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>LP_TSENS_RST_EN</name><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
        </register>
      </registers>
    </peripheral>

    <peripheral>
      <name>LP_TSENS</name>
      <description>SOURCE[ESP32S31_PAC_D0FB94E,ROM_REV0_PHY_TSENS]. Platform-owned low-power temperature sensor.</description>
      <baseAddress>0x20818000</baseAddress>
      <registers>
        <register>
          <name>CTRL</name>
          <description>Temperature-sensor data and power control.</description>
          <addressOffset>0x00</addressOffset><size>32</size><access>read-write</access><resetValue>0x00019400</resetValue>
          <fields>
            <field><name>OUT</name><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field>
            <field><name>READY</name><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>SAMPLE_EN</name><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>WAKEUP_MASK</name><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>INT_EN</name><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>IN_INV</name><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>CLK_DIV</name><bitOffset>14</bitOffset><bitWidth>8</bitWidth></field>
            <field><name>POWER_UP</name><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>POWER_UP_FORCE</name><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>CLK_CONF</name>
          <description>Temperature-sensor register-bank and PHY read-path control.</description>
          <addressOffset>0x18</addressOffset><size>32</size><access>read-write</access><resetValue>0x00000000</resetValue>
          <fields>
            <field><name>CLK_EN</name><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>PHY_CONVERSION_ENABLE_UNKNOWN</name><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>PHY_READOUT_ENABLE_UNKNOWN</name><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
        </register>
      </registers>
    </peripheral>

    <peripheral>
      <name>EFUSE</name>
      <description>SOURCE[ESP32S31_PAC_D0FB94E]. Platform-owned eFuse controller. Only the two exact read-only MAC words reached by the PHY ROM call graph are mirrored here.</description>
      <baseAddress>0x20715000</baseAddress>
      <registers>
        <register>
          <name>RD_MAC_SYS0</name>
          <description>SOURCE[ESP32S31_PAC_D0FB94E]. Exact platform-PAC register and field: low 32 bits of the system MAC address.</description>
          <addressOffset>0x50</addressOffset><size>32</size><access>read-only</access>
          <fields>
            <field><name>MAC_0</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth><access>read-only</access></field>
          </fields>
        </register>
        <register>
          <name>RD_MAC_SYS1</name>
          <description>SOURCE[ESP32S31_PAC_D0FB94E]. Exact platform-PAC register and fields: high 16 system-MAC bits and the 16 extended MAC bits.</description>
          <addressOffset>0x54</addressOffset><size>32</size><access>read-only</access>
          <fields>
            <field><name>MAC_1</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-only</access></field>
            <field><name>MAC_EXT</name><bitOffset>16</bitOffset><bitWidth>16</bitWidth><access>read-only</access></field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
  <vendorExtensions>
    <openEspRadioProvenance>
      <source id="ESP32S31_PAC_D0FB94E">ermacv/esp-pacs commit d0fb94ef39e992ca0b5fed51cb98a34c8aa8bcd5, pinned by Cargo.lock; ESP32-S31 SVD and generated PAC definitions with qualified radio-field write constraints.</source>
      <source id="S31_MODEM_LPCON_STRUCT">esp-wifi-sys commit 2585f278d381acc67c529fa730b91739b5461359, ESP32-S31 modem_lpcon_struct.h; cross-check for the pinned PAC layout.</source>
      <source id="S31_MODEM_SYSCON_STRUCT">esp-wifi-sys commit 2585f278d381acc67c529fa730b91739b5461359, ESP32-S31 modem_syscon_struct.h.</source>
      <source id="ROM_REV0_PHY_I2C">Pinned ESP32-S31 rev0 ROM PHY-I2C bodies.</source>
      <source id="ROM_REV0_PHY_FREQUENCY_CHANNEL">Pinned ESP32-S31 rev0 ROM frequency/channel bodies.</source>
      <source id="ROM_REV0_PHY_TSENS">Pinned ESP32-S31 rev0 ROM temperature-sensor bodies.</source>
      <source id="BLOB_LIBPHY_PHY_I2C">Pinned ESP32-S31 libphy.a PHY-I2C bodies.</source>
      <source id="BLOB_LIBPHY_PHY_BB_INIT">Pinned ESP32-S31 libphy.a baseband initialization body.</source>
      <source id="BLOB_LIBPHY_PHY_OPEN_I2C_XPD_NEW">Pinned ESP32-S31 libphy.a analog-I2C power/reset body.</source>
      <source id="BLOB_LIBPHY_PHY_TSENS_READ_INIT">Pinned ESP32-S31 libphy.a temperature-sensor read initialization body.</source>
      <source id="ROM_REV0_PHY_OPEN_FE_BB_CLK">Pinned ESP32-S31 rev0 ROM front-end/baseband clock body.</source>
      <source id="ROM_REV0_PHY_POWER_DETECTOR">Pinned ESP32-S31 rev0 ROM power-detector bodies.</source>
    </openEspRadioProvenance>
  </vendorExtensions>
</device>
